# Business Analytics
## Optimizing with multiple objectives: portfolio analytics
(C) 2021

In [24]:
from IPython.display import HTML, display

def optional_material():
    '''
    When run in a cell, this function will color the cell blue to indicate
    the material is optional
    '''
    script =  "var cell = this.closest('.code_cell');"
    script += "var editor = cell.querySelector('.input_area');"
    script += "editor.style.background='#bde4f0';"
    script += "this.parentNode.removeChild(this)"
    
    display(HTML(f'<img src onerror="{script}">'))
    
optional_material()

from IPython.core.display import display, HTML
display(HTML("<style>.container { width:900px !important; }</style>"))

# Introducing Pandas

In [1]:
import pandas as pd

In [2]:
df_orders = pd.read_csv('BA orders.zip')
df_orders.head()

,ORDER_ID,DATETIME,TYPE,DRINKS,COOKIES,RESTAURANT,MAIN,BASE,SIDE_1,SIDE_2,ORDER_TIME
0,O1820060,2018-10-11 17:25:50,IN_STORE,1.0,2.0,"Midtown; 1379 6th Ave, New York, NY 10019",NaN,NaN,NaN,NaN,72.0
1,O1011112,2018-05-31 11:35:00,IN_STORE,0.0,0.0,"Bryant Park; 70 W 40th St, New York, NY 10018",NaN,NaN,NaN,NaN,0.0
2,O752854,2018-04-21 18:12:57,DELIVERY,0.0,2.0,"Columbia; 2884 Broadway, New York, NY 10025",Charred Chicken Marketbowl,Farro with Summer Vegetables,Snap Peas,Green Goddess Beans with Sesame,307.0
3,O2076864,2018-11-17 12:50:52,PICKUP,1.0,0.0,"Flatiron; 40 W 25th St, New York, NY 10010",Charred Chicken Marketbowl,Classic Brown Rice,Jasper Hill Mac & Cheese,Cashew Kale Caesar,95.0
4,O1988898,2018-11-04 18:37:24,IN_STORE,0.0,0.0,"Williamsburg; 45 S 3rd St, Brooklyn, NY 11249",Spicy Meatballs Marketbowl,Farro with Summer Vegetables,Jasper Hill Mac & Cheese,Jasper Hill Mac & Cheese,171.0

In [3]:
pd.read_csv('BA orders.zip', skiprows=2).head()

,O1011112,2018-05-31 11:35:00,IN_STORE,0.0,0.0.1,"Bryant Park; 70 W 40th St, New York, NY 10018",Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,0.0.2
0,O752854,2018-04-21 18:12:57,DELIVERY,0.0,2.0,"Columbia; 2884 Broadway, New York, NY 10025",Charred Chicken Marketbowl,Farro with Summer Vegetables,Snap Peas,Green Goddess Beans with Sesame,307.0
1,O2076864,2018-11-17 12:50:52,PICKUP,1.0,0.0,"Flatiron; 40 W 25th St, New York, NY 10010",Charred Chicken Marketbowl,Classic Brown Rice,Jasper Hill Mac & Cheese,Cashew Kale Caesar,95.0
2,O1988898,2018-11-04 18:37:24,IN_STORE,0.0,0.0,"Williamsburg; 45 S 3rd St, Brooklyn, NY 11249",Spicy Meatballs Marketbowl,Farro with Summer Vegetables,Jasper Hill Mac & Cheese,Jasper Hill Mac & Cheese,171.0
3,O1026484,2018-06-02 14:32:53,DELIVERY,1.0,0.0,"Williamsburg; 45 S 3rd St, Brooklyn, NY 11249",NaN,NaN,NaN,NaN,17.0
4,O1878199,2018-10-19 19:55:09,PICKUP,0.0,0.0,"Williamsburg; 45 S 3rd St, Brooklyn, NY 11249",Herb Roasted Chicken Marketbowl,Farm Greens with Mint,Roasted Sweet Potatoes,Cashew Kale Caesar,0.0

In [4]:
df_small = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df_small

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]}, index=[5,7,9])

   A  B
5  1  4
7  2  5
9  3  6

In [6]:
pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]}).transpose()

   0  1  2
A  1  2  3
B  4  5  6

# Accessing and modifying data in a Pandas DataFrame

### Accessing columns as series

In [7]:
df_orders.head()

,ORDER_ID,DATETIME,TYPE,DRINKS,COOKIES,RESTAURANT,MAIN,BASE,SIDE_1,SIDE_2,ORDER_TIME
0,O1820060,2018-10-11 17:25:50,IN_STORE,1.0,2.0,"Midtown; 1379 6th Ave, New York, NY 10019",NaN,NaN,NaN,NaN,72.0
1,O1011112,2018-05-31 11:35:00,IN_STORE,0.0,0.0,"Bryant Park; 70 W 40th St, New York, NY 10018",NaN,NaN,NaN,NaN,0.0
2,O752854,2018-04-21 18:12:57,DELIVERY,0.0,2.0,"Columbia; 2884 Broadway, New York, NY 10025",Charred Chicken Marketbowl,Farro with Summer Vegetables,Snap Peas,Green Goddess Beans with Sesame,307.0
3,O2076864,2018-11-17 12:50:52,PICKUP,1.0,0.0,"Flatiron; 40 W 25th St, New York, NY 10010",Charred Chicken Marketbowl,Classic Brown Rice,Jasper Hill Mac & Cheese,Cashew Kale Caesar,95.0
4,O1988898,2018-11-04 18:37:24,IN_STORE,0.0,0.0,"Williamsburg; 45 S 3rd St, Brooklyn, NY 11249",Spicy Meatballs Marketbowl,Farro with Summer Vegetables,Jasper Hill Mac & Cheese,Jasper Hill Mac & Cheese,171.0

In [8]:
df_orders.TYPE

0          IN_STORE
1          IN_STORE
2          DELIVERY
3            PICKUP
4          IN_STORE
             ...
2387219    IN_STORE
2387220      PICKUP
2387221    DELIVERY
2387222    IN_STORE
2387223    IN_STORE
Name: TYPE, Length: 2387224, dtype: object

In [9]:
df_orders['TYPE']

0          IN_STORE
1          IN_STORE
2          DELIVERY
3            PICKUP
4          IN_STORE
             ...
2387219    IN_STORE
2387220      PICKUP
2387221    DELIVERY
2387222    IN_STORE
2387223    IN_STORE
Name: TYPE, Length: 2387224, dtype: object

### Accessing a subset of columns as a DataFrame

In [10]:
df_orders[['ORDER_ID', 'TYPE']]

         ORDER_ID      TYPE
0        O1820060  IN_STORE
1        O1011112  IN_STORE
2         O752854  DELIVERY
3        O2076864    PICKUP
4        O1988898  IN_STORE
...           ...       ...
2387219   O420721  IN_STORE
2387220  O1738792    PICKUP
2387221   O858342  DELIVERY
2387222  O2093417  IN_STORE
2387223   O718185  IN_STORE

[2387224 rows x 2 columns]

### Changing and resetting the index

In [14]:
df_small

   A  B
0  1  4
1  2  5
2  3  6

In [16]:
df_small.index = [4, 8, 25]
df_small

    A  B
4   1  4
8   2  5
25  3  6

In [17]:
df_small.reset_index()

   index  A  B
0      4  1  4
1      8  2  5
2     25  3  6

In [19]:
df_small = df_small.reset_index(drop=True)
df_small

   A  B
0  1  4
1  2  5
2  3  6

### Changing column names - two ways

In [20]:
df_small.columns

Index(['A', 'B'], dtype='object')

In [21]:
df_small.columns = ['Hello', 'Goodbye']
df_small

   Hello  Goodbye
0      1        4
1      2        5
2      3        6

In [22]:
df_small = df_small.rename(columns={'Hello':'A', 'Goodbye':'B'})
df_small

   A  B
0  1  4
1  2  5
2  3  6

### Adding a column

In [ ]:
# Does not work!
df_small.C = 1
df_small

In [ ]:
df_small['D'] = 1
df_small['E'] = [2,3,4]
df_small

### A warning: when to use `.copy()`

In [ ]:
df_small

In [ ]:
df_small_2 = df_small[['A', 'B']]

In [ ]:
df_small_2

In [ ]:
df_small_2.B = 5

In [ ]:
df_small_2 = df_small[['A', 'B']].copy()
df_small_2.B = 5

### Deleting rows and columns

In [ ]:
df_small_2 = df_small.copy()
df_small_2

In [ ]:
df_small_2.drop(labels=[0, 2])

In [ ]:
df_small_2.drop(columns=['B', 'E'])

### `.loc()`

In [ ]:
df_small.loc[1, 'B']

In [ ]:
df_small.loc[[0,2], ['A', 'E']]

In [ ]:
df_small.loc[[0,2], :]

In [ ]:
df_small.loc[0, :]

### `.iloc`

In [ ]:
df_small.iloc[1, 1]

In [ ]:
df_small.iloc[[0, 2], [0, 3]]

In [ ]:
df_small.iloc[0:1, :]

In [ ]:
df_small.iloc[:, 1:]

### Plotting directly from Pandas

In [ ]:
df_small.B

In [ ]:
df_small.B.plot(kind='bar')

### Operations on columns

In [ ]:
df_orders.TYPE.value_counts()

In [ ]:
df_orders.TYPE.value_counts().plot(kind='bar')

In [ ]:
df_orders.ORDER_TIME.hist(bins=50)

In [ ]:
df_orders.DRINKS.sum()

In [ ]:
df_orders.DRINKS.mean()

In [ ]:
df_orders.ORDER_TIME.median()

In [ ]:
df_small.A.tolist()

In [ ]:
(df_small.A + 3)*2

In [ ]:
import numpy as np
np.exp(df_small.A)

In [ ]:
df_orders.MAIN + ' and ' + df_orders.BASE

In [ ]:
(df_orders.DRINKS >= 1).head()

In [ ]:
((df_orders.DRINKS >= 1) & (df_orders.COOKIES >= 1)).head()

# The brackets are essential, this is WRONG and will lead to an error
# (df_orders.DRINKS >= 1 & df_orders.COOKIES >= 1).head()

In [ ]:
((df_orders.DRINKS >= 1) | (df_orders.COOKIES >= 1)).head()

In [ ]:
df_orders.head()

In [ ]:
df_orders.TYPE.isin(['IN_STORE']).head()

In [ ]:
%%time
def total_extras(row):
    return row.COOKIES + row.DRINKS

df_orders.apply(total_extras, axis=1).head()

In [ ]:
%%time
(df_orders.COOKIES + df_orders.DRINKS).head()

# Filtering DataFrames

In [ ]:
df_orders[['ORDER_ID', 'ORDER_TIME']].sort_values('ORDER_TIME', ascending=True).head()

In [ ]:
df_orders.head()

In [ ]:
df_orders[df_orders.DRINKS > 0].head()

# Plotting in `matplotlib`

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
plt.plot([1,2,3], [1,5,3])

plt.xlabel('X values', fontsize=20)
plt.ylabel('Y values', fontsize=10)

plt.xticks(fontsize=20)
plt.yticks([1, 4.5, 7])

sns.despine()

In [ ]:
fig, ax = plt.subplots()

ax.plot([1,2,3], [1,5,3])

ax.set_xlabel('X values', fontsize=20)
ax.set_ylabel('Y values', fontsize=10)

ax.tick_params(axis='x', labelsize=20)

ax.set_yticks([1, 4.5, 7])

sns.despine()